config.org
# -*- coding: utf-8 ; buffer-read-only: 1 ; -*-
#+TITLE: Emacs Configuration

* Init
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/init.el
;;; init.el --- user-init-file                    -*- lexical-binding: t -*-


(defvar current-user
  (getenv
   (if (equal system-type 'windows-nt) "USERNAME" "USER")))

(message "I'm powering up... Be patient, Master %s!" current-user)


(defvar dotfiles-core-dir (expand-file-name "core" user-emacs-directory)
    "The home of Emacs's core functionality.")

(defvar dotfiles-modules-dir (expand-file-name  "modules" user-emacs-directory)
    "This directory houses all of the built-in Emacs modules.")

(defvar dotfiles-personal-dir (expand-file-name ".personal.d" "~/")
    "This directory is for your personal configuration.")

(defvar dotfiles-custom-dir (concat user-emacs-directory "lisp/")
  "Where custom lisp files are stored")

(defvar dotfiles-screencasts-dir (expand-file-name "screencasts" user-emacs-directory)
    "The home of Emacs's core functionality.")

(dolist (dir (list dotfiles-custom-dir dotfiles-personal-dir))
  (unless (file-directory-p dir)
    (make-directory dir t)))


(defun dotfiles-add-subfolders-to-load-path (parent-dir)
  "Add all level PARENT-DIR subdirs to the `load-path'."
  (dolist (f (directory-files parent-dir))
    (let ((name (expand-file-name f parent-dir)))
      (when (and (file-directory-p name)
                 (not (string-prefix-p "." f)))
        (add-to-list 'load-path name)
        (dotfiles-add-subfolders-to-load-path name)))))

;; Always load newest byte code
(setq load-prefer-newer t)



;; We start off by telling Emacs where we intend to keep things, and some
;; other basic system setup.

;; Initialise the package system first of all.
;(package-initialize)

;; Skip the default splash screen.
(setq inhibit-startup-message t)
(setq initial-scratch-message "")

;; Figure out the current hostname.
(setq hostname (replace-regexp-in-string "\\(^[[:space:]\n]*\\|[[:space:]\n]*$\\)" "" (with-output-to-string (call-process "hostname" nil standard-output))))

;; Figure out the path to our .emacs.d by getting the path part of the
;; current file (`init.el`).
(setq dotfiles-dir (file-name-directory
                    (or (buffer-file-name) (file-chase-links load-file-name))))

;; We need to tell Emacs where to find Emacs's library packages.
(add-to-list 'load-path (concat dotfiles-dir "core"))




;; We'll keep the various parts of our configuration in the `modules` subfolder
;; of our .emacs.d. We'll need to add that to the system load path so Emacs can
;; find our modules when we ask for them.
(add-to-list 'load-path (concat dotfiles-dir "modules"))

;; Define where we want to keep `loaddefs.el` (our autoload declarations) and
;; `custom.el` (our user settings file).
(setq autoload-file (concat dotfiles-dir "loaddefs.el"))
(setq custom-file (concat dotfiles-dir "custom.el"))

(setq byte-compile-warnings nil)

;; Load the user settings from `custom.el`.
(load custom-file 'noerror)

(message "Loading modules...")



(setq custom-safe-themes t)

;; Load the Emacs fundamentals.
(require 'core-lib)
(require 'core-package)
(require 'core-module-index)
(require 'core-module-selector)
(require 'core-update)
(require 'core-personal-taste)
(require 'core-startup-wizard)
(require 'core-set-path)


; macOS specific settings
(when (eq system-type 'darwin)
 (require 'core-macos))
 ;Linux specific settings
(when (eq system-type 'gnu/linux)
  (require 'core-linux))


;; Load the enabled modules.
(when (not (boundp 'core/wizard-did-run)) (core/load-modules))
(cl-loop for file in (reverse (directory-files-recursively dotfiles-custom-dir "\\.el$"))
         do (load file))

(cl-loop for file in (reverse (directory-files-recursively dotfiles-personal-dir "\\.el$"))
         do (load file))

(cl-loop for file in (reverse (directory-files-recursively dotfiles-screencasts-dir "\\.el$"))
         do (load file))


(message "I'm ready to do thy bidding, Master %s!" current-user)



#+END_SRC
* Core
** Libraries
 #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/core/core-lib.el
 (require 'core-package)

 ;; Ensure the New Standard Library is installed and always available.
 ;; f.el    - files and paths  https://github.com/rejeep/f.el
 ;; s.el    - strings          https://github.com/magnars/s.el
 ;; dash.el - lists            https://github.com/magnars/dash.el
 (use-package f)
 (use-package s)
 (use-package dash)



 (defun core/font-lock-replace-symbol (mode reg sym)
   "Given a major mode `mode', replace the regular expression `reg' with
 the symbol `sym' when rendering."
   (font-lock-add-keywords
    mode `((,reg
            (0 (progn (compose-region (match-beginning 1) (match-end 1)
                                      ,sym 'decompose-region)))))))



 (defun core/exec (command)
   "Run a shell command and return its output as a string, whitespace trimmed."
   (s-trim (shell-command-to-string command)))

 (defun core/exec-with-rc (command &rest args)
   "Run a shell command and return a list containing two values: its return
 code and its whitespace trimmed output."
   (with-temp-buffer
     (list (apply 'call-process command nil (current-buffer) nil args)
           (s-trim (buffer-string)))))

 (defun core/is-exec (command)
   "Returns true if `command' is an executable on the system search path."
   (f-executable? (s-trim (shell-command-to-string (s-concat "which " command)))))

 (defun core/resolve-exec (command)
   "If `command' is an executable on the system search path, return its absolute path.
 Otherwise, return nil."
   (-let [path (s-trim (shell-command-to-string (s-concat "which " command)))]
     (when (f-executable? path) path)))

 (defun core/exec-if-exec (command args)
   "If `command' satisfies `core/is-exec', run it with `args' and return its
 output as per `core/exec'. Otherwise, return nil."
   (when (core/is-exec command) (core/exec (s-concat command " " args))))



 (defun core/getent (user)
   "Get the /etc/passwd entry for the user `user' as a list of strings,
 or nil if there is no such user. Empty fields will be represented as nil,
 as opposed to empty strings."
   (-let [ent (core/exec (s-concat "getent passwd " user))]
     (when (not (s-blank? ent))
       (-map (lambda (i) (if (s-blank? i) nil i))
             (s-split ":" ent)))))

 (defun core/user-full-name ()
   "Guess the user's full name. Returns nil if no likely name could be found."
   (or (core/exec-if-exec "git" "config --get user.name")
       (elt (core/getent (getenv "USER")) 4)))

 (defun core/user-email ()
   "Guess the user's email address. Returns nil if none could be found."
   (or (core/exec-if-exec "git" "config --get user.email")
       (getenv "EMAIL")))



 (provide 'core-lib)
 ;;; core-lib.el ends here
 #+END_SRC
** Linux
  #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/core/core-linux.el

 ;; On Linux Emacs doesn't use the shell PATH if it's not started from
 ;; the shell. Let's fix that:
 (use-package exec-path-from-shell)

 (exec-path-from-shell-initialize)

 (provide 'core-linux)
 #+END_SRC 
** macOS
  #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/core/core-macos.el
 (use-package exec-path-from-shell)

 (exec-path-from-shell-initialize)

 ;; It's all in the Meta
 (setq ns-function-modifier 'hyper)

 (defun user-swap-meta-and-super ()
   "Swap the mapping of Meta and Super.
 Very useful for people using their Mac with a
 Windows external keyboard from time to time."
   (interactive)
   (if (eq mac-command-modifier 'super)
       (progn
         (setq mac-command-modifier 'meta)
         (setq mac-option-modifier 'super)
         (message "Command is now bound to META and Option is bound to SUPER."))
     (setq mac-command-modifier 'super)
     (setq mac-option-modifier 'meta)
     (message "Command is now bound to SUPER and Option is bound to META.")))


 ;; There's no point in hiding the menu bar on macOS, so let's not do it
 (menu-bar-mode +1)

 ;; Enable emoji, and stop the UI from freezing when trying to display them.
 (when (fboundp 'set-fontset-font)
   (set-fontset-font t 'unicode "Apple Color Emoji" nil 'prepend))


 (provide 'core-macos)
 #+END_SRC

** Module index
 #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/core/core-module-index.el
 (setq
  core/available-modules
  '((module-appearance "how Emacs looks" :recommended)
    (module-dashboard "an emacs dashboard" :recommended)
    (module-fonts "adjust font size on the fly" :recommended)
    (module-general "basic editor settings" :recommended)
    (module-navigation "moving around better" :recommended)
    (module-ext-window-nav "alternative window navigation" :recommended)
    (module-editing "editing improvements (multiple cursors etc)" :recommended)
    (module-complete "auto completion" :recommended)
    (module-snippets "snippet management" :recommended)
    (module-dired "enhanced file manager" :recommended)
    (module-flycheck "run linters automatically with Flycheck" :recommended)
    (module-git "Git tools" :recommended)
    (module-orgmode "your personal everything manager" :recommended)
    (module-help "ways to get more help" :recommended)
    (module-helm "advanced selection and narrowing" :recommended)
    (module-markdown "Markdown support" :recommended)

    ))

 (require 'cl)
 (defcustom core/modules (mapcar #'car
                                 (remove-if-not
                                  (lambda (i) (equal :recommended (caddr i)))
                                  core/available-modules))
   "Your choice of Emacs modules.")

 (defun core/load-modules ()
   (interactive)
   (dolist (module core/modules) (require module nil t))
   (run-hooks 'core/modules-loaded-hook))

 (provide 'core-module-index)
 #+END_SRC
** Module selector
 #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/core/core-module-selector.el
 (require 'core-lib)
 (require 'widget)
 (require 'cus-edit)

 (defun core/select-modules ()
   "Select the modules that should load on startup."
   (interactive)

   (switch-to-buffer "*Emacs Modules*")
   (kill-all-local-variables)
   (-let [inhibit-read-only t] (erase-buffer))
   (remove-overlays)

   (setq-local selected-modules core/modules)

   (-let ((save-settings
           (lambda (&rest ignore)
             (interactive)
             (customize-save-variable 'core/modules selected-modules)
             (package-refresh-contents)
             (core/load-modules)
             (kill-buffer))))

     (widget-insert (propertize "Emacs Modules" 'face 'custom-group-tag))
     (widget-insert "\n")

     (widget-insert "
 This menu allows you to select feature modules for Emacs.

 Navigate between checkboxes using <tab> and S-<tab>, or use the cursor
 keys to move around. Hit <return> to toggle checkboxes, or to press the
 buttons. When you're done, press the `Save' or `Cancel' buttons, or just
 save the buffer (C-x C-s).
 ")

     (widget-insert "\n  ")
     (widget-create 'push-button
                    :tag "Save"
                    :notify save-settings)
     (widget-insert "  ")
     (widget-create 'push-button :tag "Cancel"
                    :notify (lambda (&rest ignore) (kill-buffer)))

     (widget-insert "\n\n  ")
     (apply 'widget-create 'checklist
            :indent 2
            :greedy t
            :value selected-modules
            :notify (lambda (this &rest ignore)
                      (setq-local selected-modules (widget-value this)))
            (-map (lambda (mod)
                    (-let [(sym desc) mod]
                      `(item :tag ,(s-concat (s-pad-right 24 " " (symbol-name sym)))
                             :doc ,desc
                             :value ,sym
                             :format "%t %d")))
                  core/available-modules))

     (widget-insert "\n")

     (use-local-map (copy-keymap widget-keymap))
     (local-set-key (kbd "C-x C-s") save-settings)

     (widget-setup)
     (widget-forward 1)))



 (provide 'core-module-selector)
 #+END_SRC
** Package
 #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/core/core-package.el
 ;; `(online?)` is a function that tries to detect whether you are online.
 ;; We want to refresh our package list on Emacs start if we are.
 (require 'cl)
 (defun online? ()
   (if (and (functionp 'network-interface-list)
            (network-interface-list))
       (some (lambda (iface) (unless (equal "lo" (car iface))
                          (member 'up (first (last (network-interface-info
                                                    (car iface)))))))
             (network-interface-list))
     t))

 ;; Emacs comes with a package manager for installing more features.
 ;; The default package repository doesn't contain much, so we tell it
 ;; to use MELPA as well.
 (setq package-user-dir (concat dotfiles-dir "elpa"))
 (require 'package)
 (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
 (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)

 ;; To get the package manager going, we invoke its initialise function.
 (package-initialize)

 ;; If we're online, we attempt to fetch the package directories if
 ;; we don't have a local copy already. This lets us start installing
 ;; packages right away from a clean install.
 (when (online?)
   (unless package-archive-contents (package-refresh-contents)))

 ;; `Paradox' is an enhanced interface for package management, which also
 ;; provides some helpful utility functions we're going to be using
 ;; extensively. Thus, the first thing we do is install it if it's not there
 ;; already.
 (when (not (package-installed-p 'paradox))
   (package-install 'paradox))

 ;; We're going to be using `use-package' to manage our dependencies.
 ;; In its simplest form, we can call eg. `(use-package lolcode-mode)'
 ;; to install the `lolcode-mode' package. We'd also declare one or more
 ;; entry points so the module isn't loaded unneccesarily at startup.
 ;; For instance, `(use-package my-module :commands (my-function))' will
 ;; defer loading `my-module' until you actually call `(my-function)'.
 ;;
 ;; Read about it in detail at https://github.com/jwiegley/use-package

 ;; First, we make sure it's installed, using a function provided by
 ;; Paradox, which we've just installed the hard way.
 (paradox-require 'use-package)

 ;; Next, we load it so it's always available.
 (require 'use-package)

 ;; Finally, we enable `use-package-always-ensure' which makes
 ;; use-package install every declared package automatically from ELPA,
 ;; instead of expecting you to do it manually.
 (setq use-package-always-ensure t)


 (provide 'core-package)
 #+END_SRC
** Personal taste
 #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/core/core-personal-taste.el
 (defgroup core-emacs nil
   "Your personal taste in emacs."
   :prefix "core-personal-taste/")

 (defcustom core-personal-taste/run-wizard t
   "Should we run the startup wizard on the next startup?"
   :group 'core-emacs
   :type '(choice (const :tag "Yes" t)
                  (const :tag "No" nil)))


 (provide 'core-personal-taste)
 #+END_SRC
** Set-path
 #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/core/core-set-path.el
 (paradox-require 'exec-path-from-shell)

 (when (memq window-system '(x mac ns))
   (exec-path-from-shell-initialize))

 (provide 'core-set-path)
 #+END_SRC
** Startup-wizard
 #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/core/core-startup-wizard.el

 (require 'core-personal-taste)

 (defun core-startup-wizard ()
   (interactive)

   (customize-save-variable 'core-personal-taste/run-wizard nil)
   (setq core/wizard-did-run t)
   (core/select-modules))

 (when core-personal-taste/run-wizard
   (core-startup-wizard))



 (provide 'core-startup-wizard)
 #+END_SRC

